lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
/*---------------------------------------------------------------------------
 * Pre-render static overlay elements to LTDC Layer 2 UI buffer
 * Called once at startup. Draws bottom bar + clean_text on the UI buffer.
 * Layer 2 uses ARGB1555 format: alpha=1 for overlay, alpha=0 for transparent.
 *---------------------------------------------------------------------------
 */
static void DrawTextLineCenter(uint16_t log_y, const char *text, uint16_t color);

static void PreRenderUI(void)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /* Bottom bar: 320x134 RGB565, 90 deg CCW rotation */
    const uint16_t *bar_src = (const uint16_t *)_binary_bottom_bar_raw_start;
    for (int sy = 0; sy < BAR_HEIGHT; sy++)
    {
        for (int sx = 0; sx < BAR_WIDTH; sx++)
        {
            /* 90 deg CCW: source (sx, sy) -> physical (BAR_DST_X + sy, BAR_DST_Y + (BAR_WIDTH-1-sx)) */
            int px = BAR_DST_X + sy;
            int py = BAR_DST_Y + (BAR_WIDTH - 1 - sx);
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(bar_src[sy * BAR_WIDTH + sx]);
        }
    }

    /* Clean text: 140x116 RGB565, 90 deg CCW rotation, full image (with black bg) */
    const uint16_t *text_rgb = (const uint16_t *)_binary_clean_text_rgb_raw_start;
    for (int sy = 0; sy < OVLY_LOGICAL_H; sy++)
    {
        for (int sx = 0; sx < OVLY_LOGICAL_W; sx++)
        {
            /* 90 deg CCW: source (sx, sy) -> physical (OVLY_DST_X + sy, OVLY_DST_Y + (OVLY_LOGICAL_W-1-sx)) */
            int px = OVLY_DST_X + sy;
            int py = OVLY_DST_Y + (OVLY_LOGICAL_W - 1 - sx);
            ui_buf[py * UI_BUF_STRIDE + px] = rgb565_to_argb1555(text_rgb[sy * OVLY_LOGICAL_W + sx]);
        }
    }

    /*---------------------------------------------------------------------------
     * 320x480 blue border rectangle, 2px thick, centered on portrait display.
     *   Logical: (80, 160) to (400, 640) = 320x480, centered 480x800 portrait.
     *   After 90° CCW panel rotation to physical (800x480):
     *     Top edge    (logical y=160,161)  → physical x=160,161; y=79..399  (2px wide vertical)
     *     Bottom edge (logical y=639,640)  → physical x=639,640; y=79..399  (2px wide vertical)
     *     Left edge   (logical x=80,81)    → physical y=398,399; x=160..640 (2px thick horizontal)
     *     Right edge  (logical x=399,400)  → physical y=79,80;   x=160..640 (2px thick horizontal)
     *   Interior is transparent (ARGB1555=0x0000) → animation shows through.
     *   Drawn after bottom_bar/clean_text to be on top.
     *---------------------------------------------------------------------------
     */
    #define BLUE_BORDER_ARGB1555  0x801F   /* ARGB1555: A=1, R=0, G=0, B=31 */

    /* Top edge: physical vertical lines at x=160,161, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 160] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 161] = BLUE_BORDER_ARGB1555;
    }
    /* Bottom edge: physical vertical lines at x=639,640, y=79..399 */
    for (int y = 79; y <= 399; y++)
    {
        ui_buf[y * UI_BUF_STRIDE + 639] = BLUE_BORDER_ARGB1555;
        ui_buf[y * UI_BUF_STRIDE + 640] = BLUE_BORDER_ARGB1555;
    }
    /* Left edge: physical horizontal lines at y=398,399, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[398 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[399 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }
    /* Right edge: physical horizontal lines at y=79,80, x=160..640 */
    for (int x = 160; x <= 640; x++)
    {
        ui_buf[79 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
        ui_buf[80 * UI_BUF_STRIDE + x] = BLUE_BORDER_ARGB1555;
    }

    /*---------------------------------------------------------------------------
     * Three lines centered above the 320px rectangle.
     *   Logical y=70  → "animation demo"
     *   Logical y=102 → "STM32H743IIT6"
     *   Logical y=134 → "20fps"
     *   White text (0xFFFF), transparent background.
     *---------------------------------------------------------------------------
     */
    DrawTextLineCenter(70,  "animation demo",   0xFFFF);
    DrawTextLineCenter(102, "STM32H743IIT6",    0xFFFF);
    DrawTextLineCenter(134, "20fps",            0xFFFF);
}

/* Font metrics for frame number (8x16 bitmap, 2x scaled) */
#define FONT_SCALE   2
#define CHAR_W       (8 * FONT_SCALE)   /* 16 px */

/* Use LVGL Montserrat 24 font — anti-aliased, much better than 8x16 bitmap */
#include "src/font/lv_font.h"
LV_FONT_DECLARE(lv_font_montserrat_24);
#define LV_FONT (&lv_font_montserrat_24)

#include "lv_demo.h"

#define FN_X         4
#define FN_Y         4

/*---------------------------------------------------------------------------
 * Draw a single text line horizontally centered above the 320px rectangle
 * Uses LVGL Montserrat 14 font (anti-aliased).
 *   log_y: logical y position (portrait coordinate)
 *   color: ARGB1555 color (must have A=1 bit set, e.g. 0xFFFF for white)
 *   Text is centered horizontally in the 320px rectangle (logical x=80..400).
 *   Each pixel is rotated from logical to physical via the 90° CCW mapping.
 *---------------------------------------------------------------------------
 */
static void DrawTextLineCenter(uint16_t log_y, const char *text, uint16_t color)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;

    /* First pass: calculate total width (sum of adv_w for each char) */
    int len = strlen(text);
    int total_w = 0;
    for (int i = 0; i < len; i++)
    {
        lv_font_glyph_dsc_t dsc;
        if (lv_font_get_glyph_dsc(LV_FONT, &dsc, (uint32_t)(uint8_t)text[i], 0))
            total_w += dsc.adv_w;
        else
            total_w += LV_FONT->line_height / 2; /* fallback */
    }

    /* Center horizontally in the 320px logical rectangle (x=80 to 400) */
    int log_x = 80 + ((400 - 80) - total_w) / 2;
    int cursor_x = log_x;

    /* Second pass: render each glyph */
    for (int i = 0; i < len; i++)
    {
        uint32_t letter = (uint32_t)(uint8_t)text[i];
        lv_font_glyph_dsc_t dsc;
        if (!lv_font_get_glyph_dsc(LV_FONT, &dsc, letter, 0))
        {
            cursor_x += LV_FONT->line_height / 2;
            continue;
        }

        const uint8_t *bmp = lv_font_get_glyph_bitmap(LV_FONT, letter);
        if (!bmp) continue;
        int bpp = dsc.bpp;

        /* Glyph top in logical coordinates.
         * LVGL formula: gpos_y = baseline - box_h - ofs_y
         *   baseline = log_y + (line_height - base_line)
         */
        int gpos_y = log_y + (LV_FONT->line_height - LV_FONT->base_line) - dsc.box_h - dsc.ofs_y;

        /* Render glyph bitmap (row-major: for each row, then each column).
         * LVGL stores bitmaps in row-major order with bpp bits per pixel.
         * For bpp=4: each byte = 2 pixels (high nibble first, low nibble second).
         */
        for (int row = 0; row < dsc.box_h; row++)
        {
            for (int col = 0; col < dsc.box_w; col++)
            {
                /* Extract pixel value from row-major bitmap */
                int pixel_idx = row * dsc.box_w + col;
                uint8_t pixel_val;

                if (bpp == 1)
                    pixel_val = (bmp[pixel_idx / 8] >> (7 - (pixel_idx % 8))) & 1;
                else if (bpp == 2)
                    pixel_val = (bmp[pixel_idx / 4] >> (6 - 2 * (pixel_idx % 4))) & 3;
                else if (bpp == 4)
                    pixel_val = (bmp[pixel_idx / 2] >> (4 * (1 - (pixel_idx % 2)))) & 0x0F;
                else /* bpp == 8 */
                    pixel_val = bmp[pixel_idx];

                if (pixel_val == 0) continue; /* transparent */

                /* Logical pixel position:
                 *   lx = cursor_x + ofs_x + col
                 *   ly = gpos_y + row
                 */
                int lx = cursor_x + dsc.ofs_x + col;
                int ly = gpos_y + row;

                /* Convert to physical: px = ly, py = 479 - lx */
                int px = ly;
                int py = 479 - lx;

                if (px < 800 && py < 480)
                {
                    /* For anti-aliased (bpp>1), dim the color for edge pixels */
                    if (bpp > 1)
                    {
                        int max_val = (1 << bpp) - 1;
                        int r = ((color >> 10) & 0x1F) * pixel_val / max_val;
                        int g = ((color >> 5) & 0x1F) * pixel_val / max_val;
                        int b = (color & 0x1F) * pixel_val / max_val;
                        ui_buf[py * UI_BUF_STRIDE + px] = 0x8000 | (r << 10) | (g << 5) | b;
                    }
                    else
                    {
                        ui_buf[py * UI_BUF_STRIDE + px] = color;
                    }
                }
            }
        }

