lemon9527/STM32_H743_ALIENTEK_CubeIDE/Core/Src/animation.c
        cursor_x += dsc.adv_w;
    }
}

/*---------------------------------------------------------------------------
 * Switch to LVGL page: restore a clean background and make Layer 2
 * transparent so LVGL can render its widgets (no pre-drawn overlay).
 *--------------------------------------------------------------------------
 */
static void SwitchToLVGLPage(void)
{
    /* Make Layer 2 transparent so LVGL rendering is visible and not
     * occluded by pre-drawn opaque pixels.
     */
    ClearLayer2_Transparent();
    /* Fill both animation framebuffers with opaque white so the transparent
     * Layer2 appears over a white background while LVGL is active. This
     * prevents a black background when animation buffers were previously
     * cleared to black. Fill BOTH buffers, because regardless of which one
     * is active (fb_active), we need a clean white background when switching.
     *
     * Call HAL_DMA2D_Abort() before starting to ensure DMA2D is in READY
     * state even if a previous transfer was interrupted. Without this,
     * DMA2D can get stuck in a BUSY state and the fill operation is skipped,
     * leaving stale animation pixels in the framebuffer (black/dirty background).
     */
    /* Use DMA2D R2M to fill back buffer */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0xFFFFFFFF, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Fill front buffer using DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0xFFFFFFFF, FB_FRONT, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_FRONT, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Ensure LTDC shows the white front buffer, reset fb_active to known state */
    LTDC_Layer1->CFBAR = FB_FRONT;
    fb_active = FB_FRONT;

    /* Ensure LVGL demo widgets are created only once (avoid duplicate labels
     * on repeated switches). The lv_refr_now(NULL) call forces an immediate
     * flush so Layer 2 shows the LVGL content before the next animation tick.
     *
     * On subsequent switches, invalidate the entire active screen before
     * lv_refr_now(NULL) so that LVGL re-renders all existing widgets even
     * when no new widgets are created. Without this, lv_refr_now(NULL) may
     * skip the flush callback because no dirty areas exist, resulting in a
     * blank white screen (no text visible).
     */
    if (lv_is_initialized()) {
        if (!lvgl_demo_created) {
            lvgl_demo_create();
            lvgl_demo_created = 1;
        }
        /* Invalidate the entire screen to force a full re-render */
        lv_obj_invalidate(lv_scr_act());
        /* Force an immediate LVGL refresh so flush_cb writes at least once
         * before animation resumes. This helps avoid transient black frames.
         */
        lv_refr_now(NULL);
    }

    printf("PAGE: switched to LVGL\r\n");
}

/*---------------------------------------------------------------------------
 * Switch back to animation page: restore UI overlays on Layer 2
 *---------------------------------------------------------------------------
 */
static void SwitchToAnimationPage(void)
{
    /* STEP 1: Fill both animation framebuffers to black FIRST.
     * This ensures the background is already black before any UI elements
     * appear on Layer 2. Doing this after PreRenderUI causes a visible
     * flicker: white background + UI elements → background turns black.
     */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_OUTPUT_RGB565;
    hdma2d.Init.OutputOffset = 0;
    hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.Init.RedBlueSwap   = DMA2D_RB_REGULAR;
    HAL_DMA2D_Init(&hdma2d);

    /* Clear back buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_BACK, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_BACK, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Clear front buffer via DMA2D R2M */
    HAL_DMA2D_Abort(&hdma2d);
    HAL_DMA2D_Start(&hdma2d, 0x00000000, FB_FRONT, LCD_FB_STRIDE, 480);
    HAL_DMA2D_PollForTransfer(&hdma2d, 100);
    SCB_CleanDCache_by_Addr((uint32_t *)FB_FRONT, LCD_FB_STRIDE * LCD_HEIGHT * sizeof(uint16_t));

    /* Ensure LTDC uses the front buffer and update tracking variable */
    LTDC_Layer1->CFBAR = FB_FRONT;
    fb_active = FB_FRONT;

    /* STEP 2: Now clear Layer 2 to transparent and re-render UI overlays.
     * The background is already black, so UI elements will appear on a
     * dark background with no flicker.
     */
    ClearLayer2_Transparent();
    PreRenderUI();

    printf("PAGE: switched to Animation (buffers cleared)\r\n");
}

/*---------------------------------------------------------------------------
 * Draw frame number on LTDC Layer 2 UI buffer (ARGB1555)
 * Called every frame. White text on transparent background.
 * Uses UI_BUF_STRIDE (800) instead of LCD_FB_STRIDE (1600).
 *---------------------------------------------------------------------------
 */
static void DrawFrameNumberUI(int num)
{
    uint16_t *ui_buf = (uint16_t *)UI_BUF_ADDR;
    char buf[8];
    int len = sprintf(buf, "%d", num);
    int x, y, row, col, sx, sy;

    for (int i = 0; i < len; i++)
    {
        int idx = buf[i] - '0';
        if (idx < 0 || idx > 9) continue;

        for (row = 0; row < 16; row++)
        {
            uint8_t line = digit_font[idx][row];
            for (col = 0; col < 8; col++)
            {
                /* ARGB1555: 0xFFFF = white opaque, 0x0000 = transparent */
                uint16_t pixel = (line & (0x80 >> col)) ? 0xFFFF : 0x0000;
                for (sy = 0; sy < FONT_SCALE; sy++)
                {
                    for (sx = 0; sx < FONT_SCALE; sx++)
                    {
                        x = FN_X + i * CHAR_W + col * FONT_SCALE + sx;
                        y = FN_Y + row * FONT_SCALE + sy;
                        if (x < 800 && y < 480)
                            ui_buf[y * UI_BUF_STRIDE + x] = pixel;
                    }
                }
            }
        }
    }
}

